In [2]:
from sklearn.model_selection import train_test_split

In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [31]:
df = pd.read_csv("titanic.csv")
df.drop('Cabin',axis=1,inplace=True)
df.drop('Name',axis=1,inplace=True)

## putting survivied column values in the y variable using two methods -> iloc and direct method

In [34]:
y = df.iloc[:,1]
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [35]:
y1 = df['Survived']
y1

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [36]:
df.drop('Survived',axis=1,inplace=True)
x = df.iloc[:,:]
x

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,3,male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,female,38.0,1,0,PC 17599,71.2833,C
2,3,3,female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,female,35.0,1,0,113803,53.1000,S
4,5,3,male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,887,2,male,27.0,0,0,211536,13.0000,S
887,888,1,female,19.0,0,0,112053,30.0000,S
888,889,3,female,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,male,26.0,0,0,111369,30.0000,C
890,891,3,male,32.0,0,0,370376,7.7500,Q

In [37]:
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [41]:
x.shape
y.shape

(891,)

In [43]:
df.isnull().sum()
#check weather if any value is null or not for every column and gives response accordingly

PassengerId      0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [44]:
df['Age'].fillna(df['Age'].mean(),inplace=True)

In [45]:
df.isnull().sum()

PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64